; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v4 ?v3)
             (pred_12 ?v11 ?v1)
             (pred_3 ?v4 ?v1)
             (pred_5 ?v6 ?v4 )
	     (pred_1 ?v4)
             (pred_7 ?v2)
             (pred_8 ?v11)
             (pred_9 ?v1)
             (pred_4 ?v4)
             (pred_10 ?v11)
             (pred_11 ?v4)
             (pred_6 ))



(:action op_5
:parameters (?v13 ?v12 ?v7 ?v10)
:precondition (and (pred_7 ?v13) (pred_7 ?v12) (pred_8 ?v7) (pred_9 ?v10)
          (pred_2 ?v13 ?v12) (pred_12 ?v7 ?v10)
                   (pred_3 ?v12 ?v10) (pred_1 ?v13) 
                   (pred_4 ?v12) (pred_10 ?v7))
:effect (and  (pred_11 ?v12) (not (pred_4 ?v12))))


(:action op_2
:parameters (?v13 ?v9)
:precondition (and (pred_7 ?v13) (pred_7 ?v9)
               (pred_1 ?v13) (pred_2 ?v13 ?v9) (pred_11 ?v9))
:effect (and (pred_1 ?v9) (not (pred_1 ?v13))))

(:action op_3
:parameters (?v13 ?v7)
:precondition (and (pred_7 ?v13) (pred_8 ?v7) 
                  (pred_1 ?v13) (pred_5 ?v7 ?v13) (pred_6 ))
:effect (and (pred_10 ?v7)
   (not (pred_5 ?v7 ?v13)) (not (pred_6 ))))


(:action op_1
:parameters (?v13 ?v8 ?v5)
:precondition (and (pred_7 ?v13) (pred_8 ?v8) (pred_8 ?v5)
                  (pred_1 ?v13) (pred_10 ?v5) (pred_5 ?v8 ?v13))
:effect (and (pred_10 ?v8) (pred_5 ?v5 ?v13)
        (not (pred_10 ?v5)) (not (pred_5 ?v8 ?v13))))

(:action op_4
:parameters (?v13 ?v7)
:precondition (and (pred_7 ?v13) (pred_8 ?v7) 
                  (pred_1 ?v13) (pred_10 ?v7))
:effect (and (pred_6 ) (pred_5 ?v7 ?v13) (not (pred_10 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_08 obj_20 obj_13 obj_05 obj_11 obj_27 obj_12 obj_09 obj_29 obj_06 obj_03 obj_28 obj_14 obj_01 obj_26 obj_25 obj_21 obj_23 obj_18 obj_16 obj_19 obj_24 obj_17 obj_10
    obj_22 obj_30
    obj_07 obj_04 obj_02
    )

    (:init
       (pred_6)

       (pred_7 obj_15)
       (pred_7 obj_08)
       (pred_7 obj_20)
       (pred_7 obj_13)
       (pred_7 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_27)
       (pred_7 obj_12)
       (pred_7 obj_09)
       (pred_7 obj_29)
       (pred_7 obj_06)
       (pred_7 obj_03)
       (pred_7 obj_28)
       (pred_7 obj_14)
       (pred_7 obj_01)
       (pred_7 obj_26)
       (pred_7 obj_25)
       (pred_7 obj_21)
       (pred_7 obj_23)
       (pred_7 obj_18)
       (pred_7 obj_16)
       (pred_7 obj_19)
       (pred_7 obj_24)
       (pred_7 obj_17)
       (pred_7 obj_10)
       (pred_9 obj_22)
       (pred_9 obj_30)
       (pred_8 obj_07)
       (pred_8 obj_04)
       (pred_8 obj_02)

       (pred_2 obj_15 obj_11)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_08 obj_27)
       (pred_2 obj_08 obj_20)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_20 obj_13)
       (pred_2 obj_20 obj_08)
       (pred_2 obj_13 obj_09)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_20)
       (pred_2 obj_05 obj_29)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_11 obj_06)
       (pred_2 obj_11 obj_27)
       (pred_2 obj_11 obj_15)
       (pred_2 obj_27 obj_03)
       (pred_2 obj_27 obj_12)
       (pred_2 obj_27 obj_08)
       (pred_2 obj_27 obj_11)
       (pred_2 obj_12 obj_28)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_12 obj_27)
       (pred_2 obj_09 obj_14)
       (pred_2 obj_09 obj_29)
       (pred_2 obj_09 obj_13)
       (pred_2 obj_09 obj_12)
       (pred_2 obj_29 obj_01)
       (pred_2 obj_29 obj_05)
       (pred_2 obj_29 obj_09)
       (pred_2 obj_06 obj_26)
       (pred_2 obj_06 obj_03)
       (pred_2 obj_06 obj_11)
       (pred_2 obj_03 obj_25)
       (pred_2 obj_03 obj_28)
       (pred_2 obj_03 obj_27)
       (pred_2 obj_03 obj_06)
       (pred_2 obj_28 obj_21)
       (pred_2 obj_28 obj_14)
       (pred_2 obj_28 obj_12)
       (pred_2 obj_28 obj_03)
       (pred_2 obj_14 obj_23)
       (pred_2 obj_14 obj_01)
       (pred_2 obj_14 obj_09)
       (pred_2 obj_14 obj_28)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_01 obj_29)
       (pred_2 obj_01 obj_14)
       (pred_2 obj_26 obj_16)
       (pred_2 obj_26 obj_25)
       (pred_2 obj_26 obj_06)
       (pred_2 obj_25 obj_19)
       (pred_2 obj_25 obj_21)
       (pred_2 obj_25 obj_03)
       (pred_2 obj_25 obj_26)
       (pred_2 obj_21 obj_24)
       (pred_2 obj_21 obj_23)
       (pred_2 obj_21 obj_28)
       (pred_2 obj_21 obj_25)
       (pred_2 obj_23 obj_17)
       (pred_2 obj_23 obj_18)
       (pred_2 obj_23 obj_14)
       (pred_2 obj_23 obj_21)
       (pred_2 obj_18 obj_10)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_18 obj_23)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_16 obj_26)
       (pred_2 obj_19 obj_24)
       (pred_2 obj_19 obj_25)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_24 obj_17)
       (pred_2 obj_24 obj_21)
       (pred_2 obj_24 obj_19)
       (pred_2 obj_17 obj_10)
       (pred_2 obj_17 obj_23)
       (pred_2 obj_17 obj_24)
       (pred_2 obj_10 obj_18)
       (pred_2 obj_10 obj_17)
       (pred_4 obj_09)
       (pred_4 obj_27)
       (pred_4 obj_17)
       (pred_3  obj_09 obj_22)
       (pred_3  obj_27 obj_30)
       (pred_3  obj_17 obj_30)
       (pred_11 obj_15)
       (pred_11 obj_08)
       (pred_11 obj_20)
       (pred_11 obj_13)
       (pred_11 obj_05)
       (pred_11 obj_11)
       (pred_11 obj_12)
       (pred_11 obj_29)
       (pred_11 obj_06)
       (pred_11 obj_03)
       (pred_11 obj_28)
       (pred_11 obj_14)
       (pred_11 obj_01)
       (pred_11 obj_26)
       (pred_11 obj_25)
       (pred_11 obj_21)
       (pred_11 obj_23)
       (pred_11 obj_18)
       (pred_11 obj_16)
       (pred_11 obj_19)
       (pred_11 obj_24)
       (pred_11 obj_10)

       (pred_12  obj_07 obj_22)
       (pred_12  obj_04 obj_30)
       (pred_12  obj_02 obj_30)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_04 obj_01)
       (pred_5 obj_02 obj_10)
       (pred_1 obj_03)
    )

    (:goal (and
       (pred_5 obj_07 obj_29)
       (pred_5 obj_04 obj_03)
       (pred_5 obj_02 obj_27)
    ))
(:constraints
  (always (not (pred_1 obj_14)))
)
)

; plan
1. (op_2 obj_03 obj_28)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_28)
   goals met: 0 of 3
2. (op_2 obj_28 obj_21)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_21)
   goals met: 0 of 3
3. (op_2 obj_21 obj_23)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_23)
   goals met: 0 of 3
4. (op_2 obj_23 obj_18)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_18)
   goals met: 0 of 3
5. (op_2 obj_18 obj_10)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_10)
   goals met: 0 of 3
6. (op_3 obj_10 obj_02)
   deleted: (pred_5 obj_02 obj_10) (pred_6)
   added: (pred_10 obj_02)
   goals met: 0 of 3
7. (op_2 obj_10 obj_18)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_18)
   goals met: 0 of 3
8. (op_4 obj_18 obj_02)
   deleted: (pred_10 obj_02)
   added: (pred_6) (pred_5 obj_02 obj_18)
   goals met: 0 of 3
9. (op_2 obj_18 obj_10)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_10)
   goals met: 0 of 3
10. (op_3 obj_10 obj_07)
   deleted: (pred_5 obj_07 obj_10) (pred_6)
   added: (pred_10 obj_07)
   goals met: 0 of 3
11. (op_2 obj_10 obj_18)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_18)
   goals met: 0 of 3
12. (op_2 obj_18 obj_01)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_01)
   goals met: 0 of 3
13. (op_2 obj_01 obj_29)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_29)
   goals met: 0 of 3
14. (op_5 obj_29 obj_09 obj_07 obj_22)
   deleted: (pred_4 obj_09)
   added: (pred_11 obj_09)
   goals met: 0 of 3
15. (op_4 obj_29 obj_07)
   deleted: (pred_10 obj_07)
   added: (pred_6) (pred_5 obj_07 obj_29)
   goals met: 1 of 3
16. (op_2 obj_29 obj_01)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_01)
   goals met: 1 of 3
17. (op_3 obj_01 obj_04)
   deleted: (pred_5 obj_04 obj_01) (pred_6)
   added: (pred_10 obj_04)
   goals met: 1 of 3
18. (op_2 obj_01 obj_18)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_18)
   goals met: 1 of 3
19. (op_2 obj_18 obj_23)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_23)
   goals met: 1 of 3
20. (op_2 obj_23 obj_21)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_21)
   goals met: 1 of 3
21. (op_2 obj_21 obj_25)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_25)
   goals met: 1 of 3
22. (op_2 obj_25 obj_03)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_03)
   goals met: 1 of 3
23. (op_5 obj_03 obj_27 obj_04 obj_30)
   deleted: (pred_4 obj_27)
   added: (pred_11 obj_27)
   goals met: 1 of 3
24. (op_4 obj_03 obj_04)
   deleted: (pred_10 obj_04)
   added: (pred_6) (pred_5 obj_04 obj_03)
   goals met: 2 of 3
25. (op_2 obj_03 obj_25)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_25)
   goals met: 2 of 3
26. (op_2 obj_25 obj_21)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_21)
   goals met: 2 of 3
27. (op_2 obj_21 obj_23)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_23)
   goals met: 2 of 3
28. (op_2 obj_23 obj_18)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_18)
   goals met: 2 of 3
29. (op_3 obj_18 obj_02)
   deleted: (pred_5 obj_02 obj_18) (pred_6)
   added: (pred_10 obj_02)
   goals met: 2 of 3
30. (op_2 obj_18 obj_01)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_01)
   goals met: 2 of 3
31. (op_2 obj_01 obj_29)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_29)
   goals met: 2 of 3
32. (op_2 obj_29 obj_09)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_09)
   goals met: 2 of 3
33. (op_2 obj_09 obj_12)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_12)
   goals met: 2 of 3
34. (op_2 obj_12 obj_27)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_27)
   goals met: 2 of 3
35. (op_4 obj_27 obj_02)
   deleted: (pred_10 obj_02)
   added: (pred_6) (pred_5 obj_02 obj_27)
   goals met: 3 of 3
